Tekla Open API Reference for Tekla Structures 2025
Operation.Highlight Method
 Highlight the list of objects from the user interface. Only the list of objects will be highlighted, the rest will be unhighlighted. But it will keep the status of the selected objects. To unhighlight give an empty list as a parameter.
 Namespace: Tekla.Structures.Model.Operations
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool Highlight(
	List<ModelObject> ModelObjects
)
Public Shared Function Highlight (
	ModelObjects As List(Of ModelObject)
) As Boolean
Parameters
ModelObjects
Type: System.Collections.Generic.List<ModelObject>
The list of model objects to highlight.
Return Value
Type: Boolean
True on success.
See Also
Reference
Operation Class
Tekla.Structures.Model.Operations Namespace